<?xml version="1.0" ?>
<net name="simple" version="10">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data shape="1,3,320,320" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="onnx_initializer_node_845/Output_0/Data__const" type="Const" version="opset1">
			<data offset="0" size="2592" shape="24,3,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_0/Dims5042/copy_const" type="Const" version="opset1">
			<data offset="2592" size="96" shape="1,24,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_0" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="LeakyRelu_113332/Cast_118915_const" type="Const" version="opset1">
			<data offset="2688" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="LeakyRelu_113332" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="MaxPool_2" type="MaxPool" version="opset1">
			<data strides="2,2" kernel="3,3" pads_begin="1,1" pads_end="1,1" rounding_type="floor"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="1816618169_const" type="Const" version="opset1">
			<data offset="2692" size="864" shape="24,1,1,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Conv_3/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Conv_3/Dims4844/copy_const" type="Const" version="opset1">
			<data offset="3556" size="96" shape="1,24,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv_3" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="onnx_initializer_node_851/Output_0/Data__const" type="Const" version="opset1">
			<data offset="3652" size="5568" shape="58,24,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_4/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_4/Dims4952/copy_const" type="Const" version="opset1">
			<data offset="9220" size="232" shape="1,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_4" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="LeakyRelu_513312/Cast_118841_const" type="Const" version="opset1">
			<data offset="2688" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="LeakyRelu_513312" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="onnx_initializer_node_854/Output_0/Data__const" type="Const" version="opset1">
			<data offset="9452" size="5568" shape="58,24,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>58</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_6/Dims5114/copy_const" type="Const" version="opset1">
			<data offset="15020" size="232" shape="1,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_6" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="LeakyRelu_713336/Cast_118927_const" type="Const" version="opset1">
			<data offset="2688" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="LeakyRelu_713336" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="1815818161_const" type="Const" version="opset1">
			<data offset="15252" size="2088" shape="58,1,1,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_8/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_8/Dims4826/copy_const" type="Const" version="opset1">
			<data offset="17340" size="232" shape="1,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_8" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="onnx_initializer_node_860/Output_0/Data__const" type="Const" version="opset1">
			<data offset="17572" size="13456" shape="58,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_9/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_9/Dims4784/copy_const" type="Const" version="opset1">
			<data offset="31028" size="232" shape="1,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_9" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="LeakyRelu_1013360/Cast_118887_const" type="Const" version="opset1">
			<data offset="2688" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="LeakyRelu_1013360" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Concat_11" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_13/Cast_118959_const" type="Const" version="opset1">
			<data offset="31260" size="40" shape="5" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Reshape_13" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Transpose_14/Cast_118875_const" type="Const" version="opset1">
			<data offset="31300" size="40" shape="5" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Transpose_14" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Reshape_16/Cast_118899_const" type="Const" version="opset1">
			<data offset="31340" size="32" shape="4" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_16" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Split_17/VariadicSplit_input_port_1/value/Output_0/Data__const" type="Const" version="opset1">
			<data offset="31372" size="8" shape="" element_type="i64"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="42" name="Split_17/VariadicSplit_input_port_2/value/Output_0/Data__const" type="Const" version="opset1">
			<data offset="31380" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Split_17/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1"/>
				<port id="2">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="onnx_initializer_node_863/Output_0/Data__const" type="Const" version="opset1">
			<data offset="31396" size="13456" shape="58,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_18/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_18/Dims4850/copy_const" type="Const" version="opset1">
			<data offset="44852" size="232" shape="1,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_18" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="LeakyRelu_1913308/Cast_119031_const" type="Const" version="opset1">
			<data offset="2688" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="LeakyRelu_1913308" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="1815018153_const" type="Const" version="opset1">
			<data offset="45084" size="2088" shape="58,1,1,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_20/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_20/Dims4814/copy_const" type="Const" version="opset1">
			<data offset="47172" size="232" shape="1,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_20" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="onnx_initializer_node_869/Output_0/Data__const" type="Const" version="opset1">
			<data offset="47404" size="13456" shape="58,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_21/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_21/Dims4976/copy_const" type="Const" version="opset1">
			<data offset="60860" size="232" shape="1,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_21" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="LeakyRelu_2213416/Cast_118953_const" type="Const" version="opset1">
			<data offset="2688" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="LeakyRelu_2213416" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Concat_23" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Reshape_25/Cast_118923_const" type="Const" version="opset1">
			<data offset="31260" size="40" shape="5" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Reshape_25" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Transpose_26/Cast_118979_const" type="Const" version="opset1">
			<data offset="31300" size="40" shape="5" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Transpose_26" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Reshape_28/Cast_118975_const" type="Const" version="opset1">
			<data offset="31340" size="32" shape="4" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Reshape_28" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Split_29/VariadicSplit_input_port_1/value/Output_0/Data__const" type="Const" version="opset1">
			<data offset="31372" size="8" shape="" element_type="i64"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="68" name="Split_29/VariadicSplit_input_port_2/value/Output_0/Data__const" type="Const" version="opset1">
			<data offset="31380" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Split_29/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1"/>
				<port id="2">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="onnx_initializer_node_872/Output_0/Data__const" type="Const" version="opset1">
			<data offset="61092" size="13456" shape="58,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_30/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_30/Dims4838/copy_const" type="Const" version="opset1">
			<data offset="74548" size="232" shape="1,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_30" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="LeakyRelu_3113352/Cast_118817_const" type="Const" version="opset1">
			<data offset="2688" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="LeakyRelu_3113352" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="1813818141_const" type="Const" version="opset1">
			<data offset="74780" size="2088" shape="58,1,1,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_32/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_32/Dims4778/copy_const" type="Const" version="opset1">
			<data offset="76868" size="232" shape="1,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_32" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="onnx_initializer_node_878/Output_0/Data__const" type="Const" version="opset1">
			<data offset="77100" size="13456" shape="58,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_33/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv_33/Dims5048/copy_const" type="Const" version="opset1">
			<data offset="90556" size="232" shape="1,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv_33" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="LeakyRelu_3413428/Cast_118939_const" type="Const" version="opset1">
			<data offset="2688" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="LeakyRelu_3413428" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Concat_35" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_37/Cast_119021_const" type="Const" version="opset1">
			<data offset="31260" size="40" shape="5" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Reshape_37" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Transpose_38/Cast_118829_const" type="Const" version="opset1">
			<data offset="31300" size="40" shape="5" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Transpose_38" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Reshape_40/Cast_118985_const" type="Const" version="opset1">
			<data offset="31340" size="32" shape="4" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Reshape_40" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Split_41/VariadicSplit_input_port_1/value/Output_0/Data__const" type="Const" version="opset1">
			<data offset="31372" size="8" shape="" element_type="i64"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="94" name="Split_41/VariadicSplit_input_port_2/value/Output_0/Data__const" type="Const" version="opset1">
			<data offset="31380" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Split_41/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1"/>
				<port id="2">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="onnx_initializer_node_881/Output_0/Data__const" type="Const" version="opset1">
			<data offset="90788" size="13456" shape="58,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv_42/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_42/Dims4892/copy_const" type="Const" version="opset1">
			<data offset="104244" size="232" shape="1,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_42" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="LeakyRelu_4313252/Cast_118821_const" type="Const" version="opset1">
			<data offset="2688" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="LeakyRelu_4313252" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="1814618149_const" type="Const" version="opset1">
			<data offset="104476" size="2088" shape="58,1,1,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_44/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv_44/Dims4802/copy_const" type="Const" version="opset1">
			<data offset="106564" size="232" shape="1,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_44" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="onnx_initializer_node_887/Output_0/Data__const" type="Const" version="opset1">
			<data offset="106796" size="13456" shape="58,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_45/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>58</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_45/Dims5000/copy_const" type="Const" version="opset1">
			<data offset="120252" size="232" shape="1,58,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_45" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="LeakyRelu_4613376/Cast_118819_const" type="Const" version="opset1">
			<data offset="2688" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="LeakyRelu_4613376" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Concat_47" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Reshape_49/Cast_118833_const" type="Const" version="opset1">
			<data offset="31260" size="40" shape="5" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Reshape_49" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Transpose_50/Cast_118895_const" type="Const" version="opset1">
			<data offset="31300" size="40" shape="5" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Transpose_50" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>58</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Reshape_52/Cast_119023_const" type="Const" version="opset1">
			<data offset="31340" size="32" shape="4" element_type="i64"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Reshape_52" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>58</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="onnx_initializer_node_fpn.lateral_convs.0.conv.weight/Output_0/Data__const" type="Const" version="opset1">
			<data offset="120484" size="44544" shape="96,116,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Conv_201/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Conv_201/Dims4910/copy_const" type="Const" version="opset1">
			<data offset="165028" size="384" shape="1,96,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Conv_201" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="1823018233_const" type="Const" version="opset1">
			<data offset="165412" size="4176" shape="116,1,1,3,3" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Conv_53/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Conv_53/Dims5168/copy_const" type="Const" version="opset1">
			<data offset="169588" size="464" shape="1,116,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Conv_53" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>116</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="onnx_initializer_node_893/Output_0/Data__const" type="Const" version="opset1">
			<data offset="170052" size="53824" shape="116,116,1,1" element_type="f32"/>
			<output>
				<port id="1" precision="FP32">
					<dim>116</dim>
					<dim>116</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Conv_54/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0" output_padding="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>116</dim>
					<dim>20</dim>
					<dim>20</dim>
